var emojiF={
		emoji_001 : "[微笑]",
		emoji_002 : "[撇嘴]",
		emoji_003 : "[色]",
		emoji_004 : "[發呆]",
		emoji_005 : "[得意]",
		emoji_006 : "[流淚]",
		emoji_007 : "[害羞]",
		emoji_008 : "[閉嘴]",
		emoji_009 : "[睡]",
		emoji_010 : "[大哭]",
		emoji_011 : "[尷尬]",
		emoji_012 : "[發怒]",
		emoji_013 : "[調皮]",
		emoji_014 : "[呲牙]",
		emoji_015 : "[驚訝]",
		emoji_016 : "[難過]",
		emoji_017 : "[囧]",
		emoji_018 : "[抓狂]",
		emoji_019 : "[吐]",
		emoji_020 : "[偷笑]",
		emoji_021 : "[愉快]",
		emoji_022 : "[白眼]",
		emoji_023 : "[傲慢]",
		emoji_024 : "[累]",
		emoji_025 : "[驚恐]",
		emoji_026 : "[流汗]",
		emoji_027 : "[大笑]",
		emoji_028 : "[悠閑]",
		emoji_029 : "[奮鬥]",
		emoji_030 : "[咒罵]",
		emoji_031 : "[疑問]",
		emoji_032 : "[噓]",
		emoji_033 : "[暈]",
		emoji_034 : "[衰]",
		emoji_035 : "[骷髏頭]",
		emoji_036 : "[敲打]",
		emoji_037 : "[再見]",
		emoji_038 : "[擦汗]",
		emoji_039 : "[摳鼻]",
		emoji_040 : "[鼓掌]",
		emoji_041 : "[壞笑]",
		emoji_042 : "[左哼哼]",
		emoji_043 : "[右哼哼]",
		emoji_044 : "[哈欠]",
		emoji_045 : "[鄙視]",
		emoji_046 : "[委屈]",
		emoji_047 : "[快哭了]",
		emoji_048 : "[陰險]",
		emoji_049 : "[親親]",
		emoji_050 : "[可憐]",
		emoji_051 : "[菜刀]",
		emoji_052 : "[西瓜]",
		emoji_053 : "[啤酒]",
		emoji_054 : "[咖啡]",
		emoji_055 : "[豬頭]",
		emoji_056 : "[玫瑰]",
		emoji_057 : "[枯萎]",
		emoji_058 : "[嘴唇]",
		emoji_059 : "[愛心]",
		emoji_060 : "[心碎]",
		emoji_061 : "[蛋糕]",
		emoji_062 : "[炸彈]",
		emoji_063 : "[便便]",
		emoji_064 : "[月亮]",
		emoji_065 : "[太陽]",
		emoji_066 : "[擁抱]",
		emoji_067 : "[強]",
		emoji_068 : "[弱]",
		emoji_069 : "[握手]",
		emoji_070 : "[勝利]",
		emoji_071 : "[抱拳]",
		emoji_072 : "[勾引]",
		emoji_073 : "[拳頭]",
		emoji_074 : "[OK]",
		emoji_075 : "[跳跳]",
		emoji_076 : "[發抖]",
		emoji_077 : "[噴火]",
		emoji_078 : "[轉圈]",
		/*emoji_079 : "\\ue415",//中文無效[笑臉]
		emoji_080 : "\\ue40c",//中文無效[生病]
		emoji_081 : "\\ue412",//中文無效[破涕為笑]
		emoji_082 : "\\ue409",//中文無效[吐舌]
		emoji_083 : "\\ue40d",//中文無效[臉紅]
		emoji_084 : "\\ue107",//中文無效[恐懼]
		emoji_085 : "\\ue403",//中文無效[失望]
		emoji_086 : "\\ue40e",//中文無效[無語]
*/		emoji_087 : "[吼嘿]",
		emoji_088 : "[掩面]",
		emoji_089 : "[奸笑]",
		emoji_090 : "[機智]",
		emoji_091 : "[皺眉]",
		emoji_092 : "[歐耶]",
		/*emoji_093 : "\\ue11b",//中文無效[鬼魂]
		emoji_094 : "\\ue41d",//中文無效[合十]
		emoji_095 : "\\ue14c",//中文無效[強壯]
		emoji_096 : "\\ue312",//中文無效[慶祝]
		emoji_097 : "\\ue112",//中文無效[禮物]
*/		emoji_098 : "[Packet]",
		emoji_099 : "[Chick]",
}

	String.prototype.expressionFan = function(){
		var emojiF = {
			"[微笑]":'emoji_001',
			"[撇嘴]":'emoji_002',
			"[色]":'emoji_003',
			"[發呆]":'emoji_004',
			"[得意]":'emoji_005',
			"[流淚]":'emoji_006',
			"[害羞]":'emoji_007',
			"[閉嘴]":'emoji_008',
			"[睡]":'emoji_009',
			"[大哭]":'emoji_010',
			"[尷尬]":"emoji_011",
			"[發怒]":'emoji_012',
			"[調皮]":'emoji_013',
			"[呲牙]":'emoji_014',
			"[齜牙]":'emoji_014',
			"[驚訝]":'emoji_015',
			"[難過]":'emoji_016',
			"[囧]":'emoji_017',
			"[抓狂]":'emoji_018',
			"[吐]":'emoji_019',
			"[偷笑]":'emoji_020',
			"[愉快]":'emoji_021',
			"[白眼]":'emoji_022',
			"[傲慢]":'emoji_023',
			"[累]":'emoji_024',
			"[驚恐]":'emoji_025',
			"[流汗]":'emoji_026',
			"[大笑]":'emoji_027',
			"[悠閑]":'emoji_028',
			"[奮鬥]":'emoji_029',
			"[咒罵]":'emoji_030',
			"[疑問]":'emoji_031',
			"[噓]":'emoji_032',
			"[暈]":'emoji_033',
			"[衰]":'emoji_034',
			"[骷髏頭]":'emoji_035',
			"[敲打]":'emoji_036',
			"[再見]":'emoji_037',
			"[擦汗]":'emoji_038',
			"[摳鼻]":'emoji_039',
			"[鼓掌]":'emoji_040',
			"[壞笑]":'emoji_041',
			"[左哼哼]":'emoji_042',
			"[右哼哼]":'emoji_043',
			"[哈欠]":'emoji_044',
			"[鄙視]":'emoji_045',
			"[委屈]":'emoji_046',
			"[快哭了]":'emoji_047',
			"[陰險]":'emoji_048',
			"[親親]":'emoji_049',
			"[可憐]":'emoji_050',
			"[菜刀]":'emoji_051',
			"[西瓜]":'emoji_052',
			"[啤酒]":'emoji_053',
			"[咖啡]":'emoji_054',
			"[豬頭]":'emoji_055',
			"[玫瑰]":'emoji_056',
			"[枯萎]":'emoji_057',
			"[嘴唇]":'emoji_058',
			"[愛心]":'emoji_059',
			"[心碎]":'emoji_060',
			"[蛋糕]":'emoji_061',
			"[炸彈]":'emoji_062',
			"[便便]":'emoji_063',
			"[月亮]":'emoji_064',
			"[太陽]":'emoji_065',
			"[擁抱]":'emoji_066',
			"[強]":'emoji_067',
			"[弱]":'emoji_068',
			"[握手]":'emoji_069',
			"[勝利]":'emoji_070',
			"[抱拳]":'emoji_071',
			"[勾引]":'emoji_072',
			"[拳頭]":'emoji_073',
			"[OK]":'emoji_074',
			"[跳跳]":'emoji_075',
			"[發抖]":'emoji_076',
			"[噴火]":'emoji_077',
			"[轉圈]":'emoji_078',
			"\ue415":'emoji_079',//中文無效[笑臉]
			"\ue40c":'emoji_080',//中文無效[生病]
			"\ue412":'emoji_081',//中文無效[破涕為笑]
			"\ue409":'emoji_082',//中文無效[吐舌]
			"\ue40d":'emoji_083',//中文無效[臉紅]
			"\ue107":'emoji_084',//中文無效[恐懼]
			"\ue403":'emoji_085',//中文無效[失望]
			"\ue40e":'emoji_086',//中文無效[無語]
			
			"\\ue415":'emoji_079',//中文無效[笑臉]
			"\\ue40c":'emoji_080',//中文無效[生病]
			"\\ue412":'emoji_081',//中文無效[破涕為笑]
			"\\ue409":'emoji_082',//中文無效[吐舌]
			"\\ue40d":'emoji_083',//中文無效[臉紅]
			"\\ue107":'emoji_084',//中文無效[恐懼]
			"\\ue403":'emoji_085',//中文無效[失望]
			"\\ue40e":'emoji_086',//中文無效[無語]
			"[吼嘿]":'emoji_087',
			"[掩面]":'emoji_088',
			"[奸笑]":'emoji_089',
			"[機智]":'emoji_090',
			"[皺眉]":'emoji_091',
			"[歐耶]":'emoji_092',
			"\ue11b":'emoji_093',//中文無效[鬼魂]
			"\ue41d":'emoji_094',//中文無效[合十]
			"\ue14c":'emoji_095',//中文無效[強壯]
			"\ue312":'emoji_096',//中文無效[慶祝]
			"\ue112":'emoji_097',//中文無效[禮物]
			
			"\\ue11b":'emoji_093',//中文無效[鬼魂]
			"\\ue41d":'emoji_094',//中文無效[合十]
			"\\ue14c":'emoji_095',//中文無效[強壯]
			"\\ue312":'emoji_096',//中文無效[慶祝]
			"\\ue112":'emoji_097',//中文無效[禮物]
			"[Packet]":'emoji_098',
			"[Chick]":'emoji_099',
		}
		var reg = /(\[[\w\-\u4e00-\u9fa5a]+\]|(\\ue415)|(\\ue40c)|(\\ue412)|(\\ue409)|(\\ue40d)|(\\ue107)|(\\ue403)|(\\ue40e)|(\\ue11b)|(\\ue41d)|(\\ue14c)|(\\ue312)|(\\ue112)|(\ue415)|(\ue40c)|(\ue412)|(\ue409)|(\ue40d)|(\ue107)|(\ue403)|(\ue40e)|(\ue11b)|(\ue41d)|(\ue14c)|(\ue312)|(\ue112))/g
		return this.replace(reg,function(val){
			if(!emojiF[val]) return val;
			return '<img src="/oms-web/static/admin/images/emoji/'+ emojiF[val] +'.png" width="32px">'
		});
	};
	
	
		
		
		




